OpenFOAM_Maincode/tutorials/multicomponentFluid/smallPoolFire2D/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  infinitelyFastChemistry;
//combustionModel  FSD;

infinitelyFastChemistryCoeffs
{
    semiImplicit no;
    C           5.0;
}

FSDCoeffs
{
    Cv          0.1;
    ftVarMin    1e-2;

    reactionRateFlameArea relaxation;

    fuel                Methane;

    semiImplicit        no;

    relaxationCoeffs
    {
        C                     2.0;
        alpha                 1.0;
        Methane
        {
            omega0            0.5;
            eta               -0.013;
            omegaMin          0.01;
            sigmaExt          470;
        }
        Propane
        {
            omega0            0.4;
            eta               -0.00656;
            omegaMin          0.01;
            sigmaExt          450;
        }
    }
}

#include "reaction"

// ************************************************************************* //
